app/controllers/game_users_controller.rb

  def index
    @game_users = GameUser.all
---
SELECT "game_users".* FROM "game_users"

  def create
    @game_user = GameUser.new(game_user_params)

    respond_to do |format|
      if @game_user.save
---
INSERT INTO "game_users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-06-27 17:57:35.514145"], ["updated_at", "2016-06-27 17:57:35.514145"]]

    def set_game_user
      @game_user = GameUser.find(params[:id])
---
SELECT  "game_users".* FROM "game_users" WHERE "game_users"."id" = ? LIMIT 1  [["id", 0]]